SpuerGo/Lowcost-smartlock/SmartLock.cydsn/Generated_Source/PSoC6/MYI2C.c
/***************************************************************************//**
* \file MYI2C.c
* \version 2.0
*
*  This file provides the source code to the API for the I2C Component.
*
********************************************************************************
* \copyright
* Copyright 2016-2017, Cypress Semiconductor Corporation. All rights reserved.
* You may use this file only in accordance with the license, terms, conditions,
* disclaimers, and limitations in the end user license agreement accompanying
* the software package with which this file was provided.
*******************************************************************************/

#include "MYI2C.h"
#include "sysint/cy_sysint.h"
#include "cyfitter_sysint.h"
#include "cyfitter_sysint_cfg.h"


#if defined(__cplusplus)
extern "C" {
#endif

/***************************************
*     Global variables
***************************************/

/** MYI2C_initVar indicates whether the MYI2C
*  component has been initialized. The variable is initialized to 0
*  and set to 1 the first time MYI2C_Start() is called.
*  This allows  the component to restart without reinitialization
*  after the first call to the MYI2C_Start() routine.
*
*  If re-initialization of the component is required, then the
*  MYI2C_Init() function can be called before the
*  MYI2C_Start() or MYI2C_Enable() function.
*/
uint8_t MYI2C_initVar = 0U;

/** The instance-specific configuration structure.
* The pointer to this structure should be passed to Cy_SCB_I2C_Init function
* to initialize component with GUI selected settings.
*/
cy_stc_scb_i2c_config_t const MYI2C_config =
{
    .i2cMode    = CY_SCB_I2C_SLAVE,

    .useRxFifo = false,
    .useTxFifo = false,

    .slaveAddress        = 0x8U,
    .slaveAddressMask    = 0xFEU,
    .acceptAddrInFifo    = false,
    .ackGeneralAddr      = false,

    .enableWakeFromSleep = false
};

/** The instance-specific context structure.
* It is used while the driver operation for internal configuration and
* data keeping for the I2C. The user should not modify anything in this
* structure.
*/
cy_stc_scb_i2c_context_t MYI2C_context;


/*******************************************************************************
* Function Name: MYI2C_Start
****************************************************************************//**
*
* Invokes MYI2C_Init() and MYI2C_Enable().
* Also configures interrupt and low and high oversampling phases.
* After this function call the component is enabled and ready for operation.
* This is the preferred method to begin component operation.
*
* \globalvars
* \ref MYI2C_initVar - used to check initial configuration,
* modified  on first function call.
*
*******************************************************************************/
void MYI2C_Start(void)
{
    if (0U == MYI2C_initVar)
    {
        /* Configure component */
        (void) Cy_SCB_I2C_Init(MYI2C_HW, &MYI2C_config, &MYI2C_context);

    #if (MYI2C_ENABLE_MASTER)
        /* Configure desired data rate */
        (void) Cy_SCB_I2C_SetDataRate(MYI2C_HW, MYI2C_DATA_RATE_HZ, MYI2C_CLK_FREQ_HZ);

        #if (MYI2C_MANUAL_SCL_CONTROL)
            Cy_SCB_I2C_MasterSetLowPhaseDutyCycle (MYI2C_HW, MYI2C_LOW_PHASE_DUTY_CYCLE);
            Cy_SCB_I2C_MasterSetHighPhaseDutyCycle(MYI2C_HW, MYI2C_HIGH_PHASE_DUTY_CYCLE);
        #endif /* (MYI2C_MANUAL_SCL_CONTROL) */
    #endif /* (MYI2C_ENABLE_MASTER) */

        /* Hook interrupt service routine */
    #if defined(MYI2C_SCB_IRQ__INTC_ASSIGNED)
        (void) Cy_SysInt_Init(&MYI2C_SCB_IRQ_cfg, &MYI2C_Interrupt);
    #endif /* (MYI2C_SCB_IRQ__INTC_ASSIGNED) */

        MYI2C_initVar = 1U;
    }

    /* Enable interrupt in NVIC */
#if defined(MYI2C_SCB_IRQ__INTC_ASSIGNED)
    NVIC_EnableIRQ((IRQn_Type) MYI2C_SCB_IRQ_cfg.intrSrc);
#endif /* (MYI2C_SCB_IRQ__INTC_ASSIGNED) */

    Cy_SCB_I2C_Enable(MYI2C_HW);
}

#if defined(__cplusplus)
}
#endif


/* [] END OF FILE */
